{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "dtype": "int32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": false, "batch_input_shape": [null, 1000], "dtype": "float32", "input_dim": 2874, "output_dim": 100, "embeddings_initializer": {"class_name": "Constant", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.08444000035524368, 0.36910000443458557, -0.44543999433517456, 0.6009600162506104, 0.3317500054836273, -0.4016300141811371, -0.34588000178337097, -0.0633850023150444, 0.2993299961090088, -0.2972800135612488, 0.1476600021123886, 0.5299400091171265, -0.2596200108528137, -0.3562699854373932, -0.1133200004696846, -0.2749300003051758, -0.17856000363826752, -0.2856000065803528, 0.22232000529766083, 0.1017799973487854, 0.26409998536109924, 0.8493199944496155, -0.3710800111293793, -0.2574700117111206, 0.0032494000624865294, 0.5039700269699097, 0.4471200108528137, 0.6000699996948242, 0.22943000495433807, -0.12238000333309174, 0.3102799952030182, -0.8563200235366821, 0.17760999500751495, 0.384799987077713, 0.02186400070786476, -0.39129000902175903, -0.42045000195503235, 0.2688699960708618, 0.32332998514175415, -0.19593000411987305, -0.07910200208425522, -0.035645999014377594, -0.297650009393692, 0.11051999777555466, -0.08412099629640579, -0.22721999883651733, -0.331820011138916, 0.1704300045967102, 0.07142700254917145, 0.4083000123500824, -0.4672499895095825, -0.1125900000333786, -0.16169999539852142, -0.19485999643802643, -0.37428000569343567, 0.03750000149011612, 0.6007000207901001, -0.26895999908447266, -0.11375000327825546, -0.4428899884223938, 0.12559999525547028, 0.04474100098013878, -0.01295700017362833, 0.3347100019454956, -0.1258399933576584, -0.29545000195503235, -0.36757001280784607, -0.42309999465942383, -0.20789000391960144, -0.1965000033378601, 0.0971670001745224, 0.10638999938964844, 0.478630006313324, 0.8258900046348572, -0.5764200091362, -0.05040200054645538, -0.21273000538349152, 0.2543399930000305, 1.0871000289916992, 0.0895180031657219, -0.20032000541687012, -0.37876999378204346, 0.0563340000808239, -0.571619987487793, 1.2338000535964966, 0.15268999338150024, -0.38576000928878784, -0.13388000428676605, 0.27608999609947205, 0.8171799778938293, -0.2856299877166748, 0.38769999146461487, -0.13954000174999237, 0.057479001581668854, 0.5624099969863892, 0.3761399984359741, 0.5044199824333191, 0.41179999709129333, -1.1186000108718872, 0.11615999788045883], [0.4633300006389618, -0.27504000067710876, -0.011769000440835953, -0.2873699963092804, -0.1987999975681305, -0.15376999974250793, -0.06670600175857544, -0.03065500035881996, 0.21849000453948975, -0.6585400104522705, 0.4361099898815155, -0.10446999967098236, 0.10354000329971313, -0.16527999937534332, -0.3770599961280823, 0.26627999544143677, 0.027571000158786774, -0.19242000579833984, -0.26054999232292175, 0.5200200080871582, 0.2627899944782257, -0.24819999933242798, -0.18557000160217285, -0.014329999685287476, -0.02532999962568283, -0.19970999658107758, 0.38920000195503235, -0.04929399862885475, 0.20226000249385834, 0.297870010137558, -0.10467000305652618, -0.6089500188827515, 0.16821999847888947, -0.25655001401901245, -0.14425000548362732, -0.049842000007629395, -0.036685001105070114, 0.016668999567627907, 0.07027500122785568, -0.09423699975013733, 0.050202999264001846, 0.12437000125646591, -0.27320000529289246, 0.6136299967765808, 0.10289999842643738, 0.04713600128889084, -0.43529000878334045, 0.3008800148963928, -0.20746999979019165, 0.331820011138916, 0.06964299827814102, 0.29100000858306885, -0.29291999340057373, -0.6113499999046326, 0.13951000571250916, 0.7081599831581116, 0.23308999836444855, 0.08312200009822845, -0.7098600268363953, -0.6703400015830994, 0.31589001417160034, -0.5877900123596191, 0.27946001291275024, 0.1546899974346161, -0.10292000323534012, -0.2160000056028366, 0.0429919995367527, 0.2448900043964386, 0.1764499992132187, 0.209989994764328, 0.05897799879312515, 0.396450012922287, -0.10216999799013138, -0.11808999627828598, 0.16091999411582947, 0.2150299996137619, 0.37615999579429626, 0.017657000571489334, 0.18388999998569489, 0.2433300018310547, -0.11100000143051147, -0.14316999912261963, -0.08009900152683258, -0.256740003824234, 0.17191000282764435, -0.22874000668525696, -0.1412300020456314, 0.27803000807762146, 0.3706600069999695, 0.3313100039958954, 0.20573000609874725, 0.10159999877214432, -0.0924919992685318, 0.08045800030231476, 0.7131900191307068, 0.22146999835968018, 0.21243000030517578, -0.16210000216960907, -0.3333599865436554, -0.2844499945640564], [0.4474000036716461, -0.9992200136184692, 0.7247099876403809, 0.19047999382019043, -0.18369999527931213, 0.25692999362945557, -0.15105000138282776, -0.4486500024795532, 0.0220979992300272, -0.18000000715255737, 0.9332399964332581, -0.3954800069332123, 0.19990000128746033, -0.422760009765625, 0.285180002450943, -0.3881399929523468, 0.3679499924182892, 0.04561600089073181, 0.16990000009536743, -0.24808000028133392, -0.6261900067329407, -0.4743399918079376, -0.2188899964094162, -0.2712700068950653, -0.32892999053001404, 1.0398000478744507, 0.15830999612808228, 0.9994800090789795, -0.5962299704551697, 0.015456999652087688, -0.19654999673366547, 0.557479977607727, -0.19726000726222992, 0.16550999879837036, -0.4982700049877167, 0.7038999795913696, 0.32265999913215637, 0.22127999365329742, -1.0124000310897827, -0.1866299957036972, 0.12416999787092209, 0.9477599859237671, -0.12789000570774078, 0.1994599997997284, 0.10744000226259232, 0.7140100002288818, -0.6708199977874756, 0.7214800119400024, 0.5217099785804749, 0.5071700215339661, -0.4259899854660034, -0.9486899971961975, -0.1589999943971634, -0.680400013923645, 0.603380024433136, 0.3098599910736084, -0.09105700254440308, 0.17967000603675842, -0.12015999853610992, 0.2340400069952011, -0.17533999681472778, 0.2370000034570694, -0.7364400029182434, -0.3111000061035156, 0.1669600009918213, -0.20841999351978302, 0.16279000043869019, 0.17440000176429749, 0.4462200105190277, 0.03459100052714348, -0.013182999566197395, 0.09238400310277939, -0.41220998764038086, 0.2205599993467331, -0.49726998805999756, 0.4539400041103363, -0.0036096000112593174, -0.3270300030708313, 0.2856900095939636, -0.3195900022983551, -0.3142000138759613, -0.26113998889923096, 0.634880006313324, 0.46397000551223755, 0.39024001359939575, -0.15304000675678253, -0.019586000591516495, 0.43178001046180725, 0.07988099753856659, 0.5430899858474731, 0.11315000057220459, -0.48427000641822815, -0.011682000011205673, -0.3103500008583069, 0.9067699909210205, -0.4456399977207184, -0.6001899838447571, -0.03329399973154068, 0.47102001309394836, -0.7233999967575073], [0.005856500007212162, -0.9303699731826782, -0.05229499936103821, 0.10419999808073044, -0.26363998651504517, -0.16311000287532806, -0.0617620013654232, 0.4500899910926819, 0.5283300280570984, -0.24589000642299652, 0.2177799940109253, -0.47710999846458435, -0.2538599967956543, -0.2529299855232239, 0.027549000456929207, 0.027956999838352203, 0.4509199857711792, -0.1008400022983551, -0.5412600040435791, 0.6361600160598755, -0.9175400137901306, -0.17027999460697174, 0.6845399737358093, 0.9783200025558472, 0.34108999371528625, 0.19528000056743622, -0.1543699949979782, -1.0008000135421753, -0.8612200021743774, -0.1051499992609024, 0.7485399842262268, 0.6206099987030029, 0.724370002746582, 0.34119001030921936, 0.29464998841285706, -0.05700799822807312, 0.1589999943971634, 0.4491400122642517, 0.4198800027370453, 0.49160999059677124, -0.3755599856376648, 0.580049991607666, -0.5410900115966797, 0.0653500035405159, 0.1479099988937378, -0.12326999753713608, -0.017097000032663345, -0.2543199956417084, -0.43792998790740967, 0.37775999307632446, -0.4902600049972534, 0.026446999981999397, 0.3796899914741516, -0.19614000618457794, 0.3271400034427643, 0.02508700080215931, 0.27880001068115234, -0.5842599868774414, 0.12399999797344208, -0.7112399935722351, 0.21066999435424805, 0.09723299741744995, 0.0540740005671978, 0.29264000058174133, -0.21125000715255737, -0.02002899907529354, 0.2715199887752533, 0.3425999879837036, 0.026833999902009964, -0.09619200229644775, 0.04529400169849396, -0.37261998653411865, 0.5152000188827515, 0.019867999479174614, 0.31106001138687134, 0.4081299901008606, -0.21232999861240387, -0.20517000555992126, -0.32117998600006104, -0.5118700265884399, -0.3463900089263916, -0.48563000559806824, 0.13412000238895416, 0.4164699912071228, -0.7139099836349487, 0.5843799710273743, -0.22693000733852386, -0.49448999762535095, 0.2220200002193451, 0.3649199903011322, 0.32694000005722046, -0.3343999981880188, -0.34657999873161316, 0.5065799951553345, 0.03610699996352196, 0.27340999245643616, 0.05614899843931198, -0.7314500212669373, -0.00857350043952465, -0.34834998846054077], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.1902800053358078, -0.5074499845504761, 0.08264899998903275, 0.1413699984550476, -1.176800012588501, 0.16637000441551208, -0.052494000643491745, 0.2985599935054779, 0.73444002866745, -0.061448998749256134, 0.12630000710487366, 0.23937000334262848, -0.38060998916625977, 0.35350000858306885, -0.12812000513076782, -0.04401800036430359, -0.03195999935269356, 0.40985000133514404, 0.09976600110530853, -0.3434300124645233, -0.5372099876403809, 0.15091000497341156, -0.88441002368927, 0.16297000646591187, -0.3120099902153015, -0.3400700092315674, -0.3747200071811676, 0.06889999657869339, -0.04676299914717674, 0.15937000513076782, -0.3881300091743469, 0.40310001373291016, -0.47341999411582947, 0.39840999245643616, -0.3209199905395508, -0.6899099946022034, -0.1993899941444397, -0.6773999929428101, -0.4672600030899048, -0.44510000944137573, 0.33226001262664795, 0.2043900042772293, -0.7107099890708923, 0.33114001154899597, -0.1081399992108345, 0.07379700243473053, 0.15261000394821167, 0.4580700099468231, 0.12104000151157379, 1.5025999546051025, -0.27230000495910645, -0.32903000712394714, 0.34233999252319336, -0.4496600031852722, -0.8871700167655945, 0.6571099758148193, 0.15511000156402588, -0.37880998849868774, -0.76555997133255, -0.5121399760246277, 0.18653999269008636, -0.6350100040435791, -0.7866299748420715, 0.2979600131511688, -0.3024199903011322, 0.6298699975013733, 0.08959099650382996, -0.7855299711227417, -0.2285899966955185, 0.998769998550415, 0.637440025806427, -0.4366300106048584, -0.7699199914932251, -0.1981399953365326, 0.018340999260544777, 0.5300899744033813, 0.8625199794769287, 0.19600999355316162, -0.3131299912929535, -0.44955000281333923, -0.2246900051832199, -0.6203399896621704, 0.6291400194168091, -0.004177900031208992, -0.011753999628126621, 0.2661300003528595, -0.3067300021648407, 0.16868999600410461, 0.16075000166893005, 0.4316999912261963, -0.35896000266075134, 0.0879959985613823, 0.2723200023174286, 0.11839000135660172, 0.2672800123691559, -0.6452500224113464, -0.23972000181674957, -0.447299987077713, 0.2856700122356415, 0.26510998606681824], [-0.7916600108146667, -0.18299999833106995, -0.3836199939250946, 0.049403999000787735, -0.0758500024676323, -1.0132999420166016, 0.18807999789714813, 0.6555600166320801, 0.15539999306201935, 0.053415000438690186, 0.4569000005722046, 0.7135099768638611, -0.4435499906539917, 0.6750100255012512, -0.11980000138282776, 0.44449999928474426, -0.38203001022338867, 0.6562899947166443, -0.37178999185562134, 0.46401000022888184, -1.0499000549316406, 0.5072799921035767, 0.13075000047683716, 0.35947999358177185, -0.852150022983551, 1.589900016784668, 0.5237299799919128, 0.19401000440120697, 0.005994199775159359, 0.526449978351593, 0.6206899881362915, -0.7210500240325928, -0.44266998767852783, 0.02336999960243702, -0.1447100043296814, -0.5508900284767151, 0.26987001299858093, -0.6937000155448914, 0.40845000743865967, 0.19571000337600708, 0.352649986743927, 0.3396500051021576, 0.09053400158882141, 0.5923299789428711, 0.5935900211334229, 0.3215799927711487, 0.2140199989080429, -0.22407999634742737, -0.7719399929046631, 0.5428000092506409, -0.8223699927330017, 0.3625999987125397, 0.8966599702835083, -0.06165999919176102, -0.6805899739265442, 0.8129600286483765, -1.023800015449524, 0.5965099930763245, -0.4234200119972229, 0.33002999424934387, 1.1096999645233154, -0.021438000723719597, -0.493149995803833, 1.0341999530792236, -0.5397700071334839, -0.9739900231361389, -0.6661800146102905, 0.14736999571323395, 0.9079899787902832, -0.947380006313324, 0.24632999300956726, -0.4541899859905243, 0.25404998660087585, -0.5055599808692932, -0.792739987373352, 0.28251001238822937, -0.27724000811576843, -0.19182999432086945, 0.35561999678611755, 0.20454999804496765, 0.7872099876403809, -0.6456000208854675, 0.27156999707221985, -0.34084999561309814, 0.464029997587204, 0.06803900003433228, -0.9917299747467041, 0.41780000925064087, -0.3797599971294403, -0.45026999711990356, 1.2091000080108643, 0.2748500108718872, -0.2141299992799759, -0.2972300052642822, 0.1089399978518486, 0.3805899918079376, -0.23791000247001648, -0.7282199859619141, -1.1694999933242798, 0.9888200163841248], [-0.7278599739074707, -0.7651900053024292, 0.09252600371837616, 0.2567799985408783, 1.2343000173568726, -0.003427299903705716, 0.13687999546527863, 0.15413999557495117, 0.4744899868965149, -0.04971500113606453, -0.10373999923467636, 0.06476200371980667, -0.4754199981689453, -0.6622499823570251, 0.10385999828577042, -0.49946001172065735, 0.23119999468326569, 0.015464999713003635, -0.4376299977302551, 0.23341000080108643, -0.6680099964141846, -0.4041900038719177, 0.5792700052261353, 0.6064800024032593, 0.2814599871635437, 0.7575299739837646, 0.02625899948179722, 0.4682700037956238, 0.33643001317977905, 0.058246999979019165, 0.2542699873447418, 1.0049999952316284, -0.45612001419067383, 0.3568800091743469, 0.3474400043487549, 0.4849100112915039, -0.4259899854660034, 0.14659999310970306, 0.03583800047636032, -1.2079999446868896, 0.892490029335022, 0.7897300124168396, 0.22506999969482422, 0.44078999757766724, -0.36649999022483826, 0.2064799964427948, -0.4009999930858612, 0.17212000489234924, 0.2537199854850769, 0.34773001074790955, 0.5935199856758118, 0.121069997549057, -0.24979999661445618, -0.5869600176811218, -0.7332500219345093, 0.22524000704288483, 0.414249986410141, -0.3554899990558624, 0.7106099724769592, -0.1158600002527237, -0.03735499829053879, -0.60698002576828, -0.026819000020623207, -0.18254999816417694, -0.44359999895095825, 0.30608999729156494, 0.09900099784135818, -0.9050400257110596, 0.9170399904251099, -0.5885599851608276, 0.3455300033092499, -0.34637999534606934, 0.4864700138568878, 0.23904000222682953, -0.7455400228500366, 0.5537599921226501, 0.7167999744415283, -0.1225999966263771, 0.8218500018119812, -0.3542500138282776, -0.050547998398542404, -0.5795900225639343, 1.0582000017166138, 0.5818399786949158, 0.08233000338077545, -0.36739999055862427, 0.059627000242471695, 0.1423500031232834, -0.5883200168609619, 0.3654100000858307, 0.06335200369358063, 0.09193599969148636, -0.7872700095176697, 0.15398000180721283, 0.07968000322580338, -0.10390999913215637, 0.11387000232934952, 0.7367799878120422, -0.2575399875640869, 0.12095999717712402], [0.2561199963092804, -0.27340999245643616, 0.6045200228691101, -0.24794000387191772, -0.040084999054670334, 0.2414799928665161, 0.15726999938488007, 0.004760399926453829, -0.017696000635623932, -0.10563000291585922, 0.36803001165390015, 0.5448399782180786, -0.23632000386714935, 0.05534899979829788, 0.6937100291252136, 0.7603899836540222, -0.4740400016307831, -0.029777999967336655, -0.08753500133752823, 0.09552399814128876, 0.2438499927520752, 0.6301400065422058, -0.28485000133514404, 0.29267001152038574, -0.4496299922466278, 0.6416599750518799, -0.1805800050497055, 0.5435900092124939, 0.21345999836921692, -0.04034100100398064, -0.3696799874305725, 0.16469000279903412, 0.4252699911594391, 0.03190600126981735, 0.16898000240325928, -0.10294000059366226, 0.49560999870300293, 0.06901499629020691, -0.5406699776649475, -0.5063400268554688, 0.4688799977302551, 0.31536999344825745, -0.7828099727630615, -0.12515999376773834, 0.3054099977016449, -0.6994699835777283, -0.11784999817609787, 0.6109300255775452, -0.06649699807167053, 0.39208000898361206, -0.47613999247550964, -0.5603299736976624, -0.38451001048088074, -0.7325199842453003, -0.27900999784469604, 0.9419400095939636, 0.2522900104522705, 0.44385001063346863, -0.8185700178146362, -0.2226099967956543, 0.6114599704742432, 0.11375000327825546, 0.18539999425411224, 0.2583700120449066, 0.3976700007915497, 0.5453100204467773, 0.07806599885225296, -0.06120099872350693, -0.09581100195646286, 0.03835099935531616, 0.6028800010681152, 0.15680000185966492, -0.10967999696731567, 0.30717000365257263, -0.4403899908065796, -0.35036998987197876, -0.3645699918270111, -0.5345399975776672, 0.17937999963760376, -0.41269999742507935, 0.41091999411582947, -0.6208000183105469, 0.16562999784946442, 0.37463998794555664, 0.054354000836610794, -0.2619200050830841, 0.5290200114250183, 0.45664000511169434, 0.4967299997806549, -0.38288000226020813, 0.16910000145435333, -0.004209499806165695, 0.30414000153541565, 0.1996700018644333, 0.1684899926185608, -0.46160000562667847, 0.39282000064849854, -0.18382999300956726, 0.34452998638153076, -0.4916499853134155], [-0.1292099952697754, -0.824180006980896, -0.8551999926567078, 0.15248000621795654, -0.3883399963378906, 0.5095999836921692, -0.6519700288772583, -0.27553999423980713, -0.5814399719238281, 0.2430099993944168, 0.18498000502586365, 0.21381999552249908, -0.2044599950313568, -0.15509000420570374, -0.15663999319076538, 0.5462999939918518, 0.39120998978614807, -0.9498900175094604, 0.1589300036430359, -0.4207800030708313, 1.2039999961853027, -0.3014200031757355, 0.8680700063705444, -0.41644999384880066, -0.8056700229644775, -0.12428999692201614, -0.4696199893951416, -0.7759699821472168, -0.31393998861312866, -1.2431999444961548, -0.6620200276374817, -0.1329299956560135, 0.756060004234314, 0.40852999687194824, 0.02317200042307377, -0.5960900187492371, 0.4860199987888336, 0.848360002040863, 0.6129400134086609, -0.6239200234413147, 0.025770999491214752, 0.9523299932479858, 0.2125300019979477, -0.6532999873161316, 0.04217299818992615, 0.9610199928283691, 0.5677599906921387, -0.1860000044107437, 0.4984099864959717, -0.5122399926185608, -0.7435399889945984, 0.036699000746011734, 0.22863000631332397, -0.04473400115966797, 0.05012600123882294, 0.9848399758338928, 0.3488300144672394, 0.026926999911665916, 0.3860200047492981, -0.4728200137615204, -0.30368998646736145, 0.3124600052833557, -0.11839000135660172, -0.7812899947166443, 0.9909800291061401, 0.36761000752449036, 0.4116800129413605, -0.013794999569654465, 0.49296998977661133, 0.7228599786758423, 0.23551000654697418, -0.1425900012254715, -0.3878999948501587, 0.35635000467300415, 0.2728399932384491, -0.44898998737335205, -0.056814998388290405, 0.5514000058174133, -0.37999001145362854, 0.5001000165939331, -0.6563000082969666, -1.4297000169754028, 0.5493599772453308, 0.26798999309539795, -0.18786999583244324, 1.1639000177383423, -1.045300006866455, 0.44492000341415405, 0.041703999042510986, 1.3104000091552734, 0.31147998571395874, -0.3028300106525421, -0.30107998847961426, 0.36041998863220215, 0.03197300061583519, -0.3699699938297272, -0.40887001156806946, -0.1604599952697754, -1.0404000282287598, -0.9282900094985962], [0.5771300196647644, -0.33092001080513, -0.4196299910545349, 0.6220200061798096, 0.46362000703811646, -0.030424000695347786, -0.011241000145673752, 0.5874900221824646, -0.6335600018501282, 0.7550399899482727, 0.21278999745845795, -0.11534000188112259, 0.30024999380111694, 0.498089998960495, -0.28341999650001526, 0.7828699946403503, 0.5807999968528748, -0.773639976978302, 0.6965399980545044, -0.014929000288248062, 0.7395700216293335, 0.18122999370098114, -0.19257000088691711, 0.2769800126552582, 0.21257999539375305, 1.0119999647140503, 0.36076998710632324, 0.14350000023841858, 0.6867300271987915, 0.28925999999046326, -1.1901999711990356, 0.04142199829220772, -0.5011299848556519, 0.524590015411377, -0.6020900011062622, -0.1137399971485138, -0.008212000131607056, -0.830810010433197, -0.20914000272750854, -1.777400016784668, 0.3900200128555298, -0.18818999826908112, -1.0449999570846558, 0.6705499887466431, -0.34588998556137085, -0.7063800096511841, 0.714709997177124, 0.15023000538349152, -0.5553900003433228, 1.3701000213623047, -0.6438199877738953, 0.19941000640392303, -0.8008400201797485, 0.21599000692367554, -1.3516000509262085, 0.24188999831676483, 0.7137799859046936, -0.4723699986934662, -0.5288299918174744, 0.12154000252485275, 0.9780099987983704, 0.8952500224113464, -0.7098199725151062, 0.1697400063276291, -0.46643000841140747, 0.16297000646591187, 0.26837000250816345, 0.1608700007200241, 0.5002999901771545, -0.4772300124168396, 0.48256999254226685, -0.462799996137619, 0.4301399886608124, 0.002737599890679121, -0.8853999972343445, -0.4311099946498871, -0.08555799722671509, -1.2999999523162842, 0.2674199938774109, -0.29168999195098877, -0.04338100180029869, -0.8425099849700928, 0.14056000113487244, -0.6009100079536438, -0.2851499915122986, -0.3397800028324127, -0.7216500043869019, -0.9409999847412109, -0.21020999550819397, 0.32822999358177185, 0.3386699855327606, -1.0125999450683594, 0.8111799955368042, 0.8814700245857239, 1.218999981880188, -0.12357000261545181, 0.7388700246810913, 0.5615299940109253, 0.945169985294342, -0.8467299938201904], [0.13360999524593353, -0.6248499751091003, -0.08127599954605103, 0.015084999613463879, -1.1907000541687012, -0.08905799686908722, -0.2996099889278412, -0.03135500103235245, 1.101099967956543, 0.4272100031375885, 0.31244000792503357, -0.11935999989509583, 0.45065999031066895, -0.07706400007009506, -0.4126099944114685, -0.037241000682115555, 0.5016899704933167, 0.03417700156569481, -0.19913999736309052, 0.49564000964164734, 0.2650499939918518, 0.16000999510288239, -0.2079000025987625, 0.2805199921131134, 0.9393799901008606, -0.29155999422073364, -0.5811700224876404, 0.41703999042510986, -0.04463399946689606, 0.3709000051021576, -0.2837499976158142, -0.1914599984884262, -0.6383900046348572, 1.176300048828125, -0.650629997253418, 0.2016800045967102, 0.5728499889373779, -0.035992998629808426, -0.23413999378681183, 0.6345300078392029, -0.2199299931526184, 0.9137600064277649, 0.005166599992662668, 0.2834700047969818, -0.5648900270462036, 0.14608000218868256, -0.45298999547958374, 0.5261499881744385, -0.32409998774528503, -0.047655001282691956, -0.4402799904346466, 0.030407000333070755, -0.12852999567985535, -0.12212000042200089, 0.4181300103664398, 0.38881999254226685, 0.506309986114502, 1.354699969291687, -0.49627000093460083, -0.011734999716281891, -0.1420699954032898, 0.22332000732421875, 0.10661999881267548, -0.4249899983406067, -0.5458199977874756, 0.31014999747276306, 0.7599700093269348, -0.30963000655174255, 0.46643000841140747, -0.23980000615119934, -0.21367000043392181, 0.37463000416755676, -0.7082899808883667, 0.1707099974155426, 0.9835000038146973, 0.8533899784088135, 0.6351900100708008, -0.36195001006126404, 0.5149099826812744, 0.03300900012254715, -0.3046000003814697, -0.7463799715042114, -0.33785000443458557, -0.2602500021457672, 0.35600998997688293, 0.8536900281906128, 0.2498999983072281, -0.10849999636411667, 0.9848700165748596, 0.39605000615119934, -0.006686599925160408, 0.09081199765205383, 0.29085999727249146, 0.9264699816703796, 1.0357999801635742, 0.052115000784397125, 0.021431000903248787, -0.1231900006532669, -0.7208799719810486, -0.7186300158500671], [-0.5180699825286865, 0.578790009021759, 0.8929399847984314, 0.15746000409126282, 0.262939989566803, 0.4018700122833252, 0.38909000158309937, -0.3164699971675873, 0.04855800047516823, 0.2499299943447113, 0.014162999577820301, -0.7748299837112427, -0.5281400084495544, 0.08426299691200256, -0.8077600002288818, 0.42805999517440796, -0.752839982509613, -0.15503999590873718, -0.45598000288009644, -0.564490020275116, 0.4325200021266937, 0.09108100086450577, -0.5604400038719177, 1.1998000144958496, -0.2190600037574768, -0.4489800035953522, -0.36445000767707825, 0.42528000473976135, -0.41822999715805054, -0.38901999592781067, -0.1963299959897995, 0.48100998997688293, 0.6579800248146057, 0.87117999792099, -0.30527999997138977, -0.8093000054359436, 0.734529972076416, -0.07386399805545807, 0.09319300204515457, 0.5181199908256531, 0.7778199911117554, -0.3127099871635437, -1.0702999830245972, -0.31654998660087585, -0.8930299878120422, -0.27998998761177063, -0.48750001192092896, -1.0773999691009521, 0.08200400322675705, -0.06852199882268906, -0.7224900126457214, -0.4380899965763092, -0.5631899833679199, -0.38486000895500183, -0.8021299839019775, -0.12404999881982803, 0.8065699934959412, 0.6068999767303467, 0.21233999729156494, 0.41905999183654785, -0.8558599948883057, -0.6207399964332581, -1.3564000129699707, -0.12166000157594681, 0.14111000299453735, 0.7378399968147278, 0.9421499967575073, 0.4981899857521057, -0.2276799976825714, 0.8978000283241272, -0.5218300223350525, -0.3114199936389923, -0.12504999339580536, -0.9617499709129333, 0.4611299932003021, -0.8001599907875061, -0.1654299944639206, -0.20893999934196472, -0.9201899766921997, 0.6712999939918518, -0.8461999893188477, -1.0078999996185303, 0.562720000743866, -0.12205000221729279, -0.20340000092983246, 0.6329900026321411, 0.004874600097537041, 0.042768001556396484, 0.3480899930000305, 0.9319300055503845, -0.9413099884986877, -0.004720100201666355, 0.8064500093460083, 1.0003000497817993, -0.8900899887084961, -0.3167400062084198, 0.35899999737739563, -0.5964300036430359, -0.0031109999399632215, -1.2532000541687012], [0.1468999981880188, -0.345770001411438, -0.49459001421928406, 0.22762000560760498, -0.7986900210380554, -0.33039000630378723, 0.2481900006532669, -0.09553500264883041, 0.39441999793052673, -0.24236999452114105, 0.247979998588562, 0.25363999605178833, 0.08791500329971313, -0.25501999258995056, -0.048622000962495804, -0.11095999926328659, -0.4863399863243103, 0.3740200102329254, 0.20588000118732452, 0.26409998536109924, 0.48993000388145447, 0.23795999586582184, -0.7940999865531921, 0.149959996342659, -0.23194000124931335, 0.5031099915504456, 0.41593000292778015, 0.019977999851107597, 0.14399999380111694, 0.03777199983596802, 0.1313299983739853, 0.46568000316619873, -0.058664001524448395, 0.024281000718474388, 0.035610999912023544, -0.09582100063562393, 0.45813998579978943, -0.27472999691963196, -0.20082999765872955, 0.3983199894428253, 0.0495930016040802, 0.5045400261878967, 0.10732000321149826, 0.12450999766588211, 0.05277400091290474, -0.3486199975013733, -0.6143900156021118, 0.7254499793052673, -0.0211350005120039, 0.4331800043582916, -0.25442999601364136, -0.2608700096607208, -0.09314599633216858, -0.18508000671863556, 0.24501000344753265, 0.9804099798202515, 0.32947999238967896, 0.4655599892139435, -0.38710999488830566, -0.4353500008583069, -0.21035000681877136, -0.4019100069999695, -0.8345299959182739, -0.22404000163078308, -0.23193000257015228, 0.3582099974155426, -0.4292899966239929, -0.36281999945640564, -0.48993000388145447, 0.22348999977111816, 0.1487099975347519, 0.5204300284385681, 0.18053999543190002, 0.5935699939727783, 0.005617300048470497, 0.17635999619960785, 0.05633699893951416, -0.22978000342845917, 0.39041000604629517, 0.0037658000364899635, -0.3295600116252899, -0.37841999530792236, 0.2898699939250946, -0.17145000398159027, 0.3055199980735779, 0.04290800169110298, -0.17427000403404236, 0.2707200050354004, 0.14815999567508698, 0.026576999574899673, 0.3124600052833557, 0.4780699908733368, 0.6469200253486633, -0.38686999678611755, 0.6288800239562988, 0.1314699947834015, 0.25641000270843506, -0.3322100043296814, -0.48927000164985657, -0.12905000150203705], [-0.34536001086235046, -0.3188000023365021, -0.8860499858856201, 0.42781001329421997, -0.3549700081348419, 0.40046998858451843, 0.28009000420570374, -0.044780999422073364, 0.15526999533176422, -0.18682000041007996, 0.33258000016212463, 0.20520000159740448, -0.12116999924182892, 0.11462000012397766, 0.05629799887537956, 0.1507599949836731, -0.2972800135612488, -0.7648199796676636, -0.07259699702262878, 0.40977999567985535, -0.23249000310897827, 0.22569000720977783, -0.3518899977207184, -0.29693999886512756, -0.04782700166106224, 0.28453999757766724, -0.47398999333381653, 0.38514000177383423, -0.29701998829841614, 0.1998099982738495, 0.1901399940252304, -0.12334000319242477, 0.33809998631477356, 0.23044000566005707, 0.14151999354362488, -0.5121399760246277, -0.11027999967336655, -0.006602100096642971, -0.1140500009059906, -0.22112999856472015, -0.009306100197136402, 0.45124998688697815, -0.6075400114059448, 0.31463000178337097, -0.010724999941885471, -0.06030900031328201, -0.6772000193595886, 0.28575998544692993, -0.0472089983522892, 0.8887400031089783, -0.38763999938964844, 0.3975299894809723, -0.1096000000834465, -0.7416099905967712, 0.015678999945521355, 0.4603399932384491, 0.1961899995803833, 0.11361999809741974, -0.37112998962402344, -0.37825000286102295, -0.4322899878025055, -0.5579699873924255, 0.03990200161933899, -0.6217799782752991, -0.11646000295877457, 0.10452999919652939, -0.3742400109767914, 0.08454500138759613, 0.16738000512123108, -0.1549299955368042, 0.10857000201940536, 0.1902800053358078, -0.04069000110030174, 0.04331599920988083, 0.14767000079154968, -0.10260999947786331, 0.19713999330997467, 0.4000000059604645, 0.23771999776363373, -0.13131999969482422, -0.5659599900245667, 0.09313599765300751, 0.0329819992184639, -0.17036999762058258, 0.5164300203323364, 0.3808700144290924, -0.11337999999523163, -0.12150999903678894, 0.41898998618125916, 0.35618001222610474, 0.14083999395370483, -0.3282099962234497, 0.7174699902534485, -0.05417799949645996, 0.6028199791908264, -0.2832300066947937, 0.30382001399993896, -0.4319800138473511, -0.16492000222206116, 0.2004300057888031], [-0.2067900002002716, -0.06401299685239792, 0.5169500112533569, 0.5425400137901306, 0.028459999710321426, -0.5697799921035767, 0.5607799887657166, -0.09779000282287598, -0.4318400025367737, 0.28029000759124756, -0.12594999372959137, 0.306410014629364, -0.8374500274658203, -0.5156400203704834, 0.24778999388217926, -0.47058001160621643, 0.17010000348091125, 0.18299999833106995, 0.5415199995040894, 0.3368299901485443, 0.33463001251220703, 0.10559999942779541, -0.656499981880188, -0.05962999910116196, 0.17369000613689423, -0.26721999049186707, 0.23558999598026276, -0.35826000571250916, -0.8360499739646912, -0.2927899956703186, 0.6866499781608582, 0.882889986038208, -0.48561999201774597, -0.5229700207710266, 1.1446000337600708, 1.2727999687194824, 0.5406299829483032, 0.3284899890422821, 0.02028699964284897, -0.4858900010585785, 1.1722999811172485, -0.24873000383377075, -0.16234000027179718, -0.2114800065755844, 0.09783300012350082, 0.16863000392913818, -0.41481998562812805, -0.8309500217437744, 0.10012000054121017, -0.5727699995040894, -0.14774000644683838, -0.10982999950647354, -0.6116499900817871, 0.1884399950504303, -0.2838299870491028, -1.1621999740600586, 0.3930799961090088, -0.029760999605059624, 1.7928999662399292, -0.44078999757766724, 0.4152800142765045, -0.07086800038814545, -0.406360000371933, 0.057833001017570496, 0.24922999739646912, 0.04267499968409538, 0.3157599866390228, -0.6652399897575378, 0.6882200241088867, -0.3696500062942505, 0.06471499800682068, -0.4085499942302704, 0.4227299988269806, 0.5850800275802612, -0.24009999632835388, 0.7084299921989441, 0.4443100094795227, -0.1263899952173233, -0.26388001441955566, -0.4391399919986725, 0.28777000308036804, -0.5358999967575073, 0.022854000329971313, -0.20410999655723572, -0.06544800102710724, -0.8919900059700012, -0.5128399729728699, -0.46797001361846924, -0.02122499980032444, 0.09157299995422363, -0.3464699983596802, -0.27998000383377075, -0.48781999945640564, -0.9836999773979187, -0.8384000062942505, -0.02533699944615364, 0.672469973564148, -0.12098000198602676, 1.2833000421524048, 0.15473000705242157], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.025213999673724174, -0.6304600238800049, -0.2457900047302246, -0.10279999673366547, -0.4993399977684021, 0.04663100093603134, -0.2070399969816208, -0.2883400022983551, 0.4344500005245209, 0.040031999349594116, -0.1676899939775467, 0.3816399872303009, -0.22766000032424927, 0.3629100024700165, -0.014535999856889248, -0.20730000734329224, -0.6195099949836731, 0.13861000537872314, -0.35179001092910767, 0.06336899846792221, -0.8073499798774719, 0.04649300128221512, -0.7554600238800049, -0.40950000286102295, -0.41523998975753784, -0.2234099954366684, 0.4139299988746643, 0.864329993724823, 0.009227200411260128, -0.025397999212145805, -0.01878100074827671, 0.15261000394821167, 0.09193000197410583, 0.005378900095820427, 0.045924000442028046, 0.24280999600887299, -0.12231999635696411, 0.44183000922203064, 0.48403000831604004, 0.26521000266075134, -0.11421000212430954, 0.559719979763031, 0.3149000108242035, 0.17319999635219574, -0.20054000616073608, -0.8202999830245972, 0.3021000027656555, 0.6876099705696106, 0.07180099934339523, -0.1517699956893921, -0.7579799890518188, 0.29370999336242676, -0.09656000137329102, -0.5886399745941162, -0.6097400188446045, 0.3337700068950653, 0.05964000150561333, 0.11011999845504761, -0.24724000692367554, -0.14151999354362488, 0.3467000126838684, 0.3272800147533417, 0.25227999687194824, 0.02938299998641014, 0.08179300278425217, 0.3460800051689148, -0.33994999527931213, -0.3423900008201599, 0.15132999420166016, 0.10857000201940536, 0.3568899929523468, 0.32594001293182373, -0.03726999834179878, -0.08048000186681747, -0.5467399954795837, 0.32771000266075134, -0.28738999366760254, -0.05652499943971634, 0.4263100028038025, -0.042670998722314835, -0.9329500198364258, -0.4635399878025055, 0.36076000332832336, 0.10553000122308731, 0.38624998927116394, -0.09124000370502472, -0.48030000925064087, 0.3689799904823303, 0.5334200263023376, 0.8619800209999084, -0.5554900169372559, 0.21738000214099884, -0.09769599884748459, -0.4855000078678131, 0.13936999440193176, -0.6587799787521362, 0.6022099852561951, 0.38495999574661255, -0.41479000449180603, 0.08325599879026413], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.11444000154733658, -1.0947999954223633, 0.20768000185489655, -0.12218999862670898, 0.06626500189304352, -0.07483600080013275, -0.6771500110626221, -0.21966999769210815, 0.7922899723052979, 0.5163099765777588, 0.08655299991369247, 0.48217999935150146, 0.2192700058221817, -0.5705599784851074, 0.38464999198913574, 0.2781499922275543, -0.3285300135612488, -0.015685999765992165, 0.43553999066352844, 0.2496500015258789, -0.09621000289916992, -0.020882999524474144, 0.24532000720500946, -0.11296000331640244, 0.5961899757385254, 0.09769000113010406, 0.5008299946784973, 0.17659999430179596, -0.20916999876499176, -0.014623000286519527, -0.4071100056171417, 0.11078000068664551, 0.2829599976539612, 0.5267699956893921, 0.1550299972295761, 0.3557099997997284, 0.403219997882843, 0.7642999887466431, -0.18071000277996063, -0.2198600023984909, -0.390390008687973, 0.18684999644756317, -0.6060299873352051, -0.026210999116301537, 0.12434999644756317, -0.3535099923610687, -0.7899799942970276, -0.2198300063610077, 0.0948290005326271, 0.18717999756336212, -0.36886000633239746, -0.3144899904727936, -0.4591200053691864, -0.23465999960899353, -0.3252499997615814, 0.8503999710083008, 0.36864998936653137, 0.2764900028705597, -0.5430499911308289, -0.2070000022649765, -0.12892000377178192, 0.0994039997458458, 0.10569000244140625, -0.13179999589920044, -0.3673099875450134, 0.13619999587535858, -0.0027214998845010996, 0.23734000325202942, -0.24347999691963196, 0.014468000270426273, 0.1410199999809265, 0.5437999963760376, -0.5027300119400024, -0.05830100178718567, -0.17960000038146973, -0.0204050000756979, -0.5227199792861938, 0.31775999069213867, 0.07795999944210052, -0.5023699998855591, 0.22178000211715698, 0.0665929988026619, 0.08809299767017365, -0.13224999606609344, 0.4022200107574463, 0.29078999161720276, -0.48956000804901123, 0.17971999943256378, 0.11529000103473663, 0.24907000362873077, -0.5084599852561951, -0.7069900035858154, 0.038697998970746994, 0.4309900104999542, 0.15395000576972961, -0.4502600133419037, -0.40713998675346375, -0.837090015411377, -1.2081999778747559, -0.2190299928188324], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.6802099943161011, -0.5649700164794922, 0.2362000048160553, -0.27592000365257263, 1.1130000352859497, 0.3796600103378296, -0.22192999720573425, -0.059606000781059265, 1.0812000036239624, -0.2858099937438965, 1.283400058746338, 0.27316999435424805, -0.28720998764038086, -0.8979700207710266, 0.6016700267791748, 0.3806599974632263, 1.0104000568389893, 0.3200500011444092, -0.24778999388217926, 0.7591699957847595, -0.3337000012397766, -0.516979992389679, 0.739080011844635, 0.4504300057888031, -0.03299599885940552, -0.13120999932289124, 0.5013599991798401, 0.2507700026035309, 0.9958800077438354, 0.29927000403404236, 0.16412000358104706, 1.3697999715805054, -0.6672899723052979, 0.1651500016450882, 0.9352899789810181, 0.5377100110054016, -0.5783200263977051, -0.5239199995994568, 0.12875999510288239, -1.448099970817566, 0.8450000286102295, 0.5471699833869934, -0.556850016117096, 0.03427400067448616, -0.28971999883651733, -0.09576000273227692, -0.16008000075817108, -1.152400016784668, 1.0147000551223755, -0.07404399663209915, 0.9927800297737122, 0.208529993891716, -0.2180899977684021, -0.3002299964427948, -0.3089900016784668, -1.1648999452590942, -0.24833999574184418, -0.2798599898815155, 1.850000023841858, -0.11231999844312668, -0.058692000806331635, 0.6810299754142761, -0.663670003414154, -0.27730000019073486, 0.25134000182151794, 0.4316200017929077, 0.0817909985780716, -0.4587700068950653, 0.34053999185562134, -0.928849995136261, -0.10717999935150146, 0.2864300012588501, 0.61176997423172, 0.014531999826431274, -0.3446100056171417, 0.8973000049591064, -0.12771999835968018, -0.4607900083065033, 0.4556500017642975, -1.0889999866485596, 0.4666000008583069, -0.5281800031661987, -0.13774999976158142, 0.2472900003194809, -0.9552500247955322, 0.167820006608963, 0.5194100141525269, -0.2025199979543686, -0.17217999696731567, 0.675849974155426, -0.6050999760627747, 0.8413100242614746, 0.006881000008434057, -0.9762200117111206, 0.2445099949836731, -0.9675400257110596, 0.15929999947547913, 0.13987000286579132, 1.0508999824523926, -0.2194100022315979], [0.4009700119495392, -0.3183700144290924, -0.5735700130462646, 0.36601001024246216, -0.047648001462221146, -0.23726999759674072, 0.1084199994802475, -0.10367999970912933, 0.1762399971485138, -0.4233199954032898, 0.378710001707077, 0.5729299783706665, -0.18640999495983124, -0.1976899951696396, 0.033156998455524445, -0.30140000581741333, -0.4500400125980377, 0.40700000524520874, 0.20705999433994293, 0.16255000233650208, 0.07726699858903885, 0.21799999475479126, -0.7290599942207336, 0.3813599944114685, -0.14722999930381775, 0.6991400122642517, 0.6274899840354919, 0.3959699869155884, -0.13106000423431396, -0.4141800105571747, 0.2720099985599518, -0.11818999797105789, 0.1275400072336197, -0.16543999314308167, 0.07596199959516525, -0.5660300254821777, -0.10447999835014343, -0.9173099994659424, -0.39855000376701355, -0.006937500089406967, 0.25690001249313354, 0.05591300129890442, 0.11063999682664871, 0.05845100060105324, -0.026650000363588333, -0.4215199947357178, -0.5553200244903564, 0.5137500166893005, -0.3223100006580353, 0.5615500211715698, -0.517769992351532, 0.0844390019774437, 0.21254000067710876, -0.020493999123573303, -0.004653099924325943, 1.0228999853134155, -0.22142000496387482, 0.35194000601768494, -0.7060400247573853, 0.05522400140762329, -0.09560800343751907, -0.5597000122070312, -0.1922599971294403, -0.17685000598430634, 0.43073999881744385, 0.39952999353408813, -0.8596600294113159, -0.31387001276016235, -0.34341999888420105, 0.3137199878692627, 0.4205000102519989, 0.48205000162124634, -0.37814998626708984, 0.43599000573158264, 0.45691001415252686, 0.032774001359939575, -0.10281000286340714, -0.10409999638795853, 0.7461599707603455, 0.23691999912261963, -0.21299000084400177, -0.28209999203681946, 0.06976000219583511, -0.40731000900268555, 0.6503199934959412, -0.2160000056028366, -0.12640999257564545, 0.36653000116348267, -0.13833999633789062, 0.6915500164031982, -0.30573999881744385, 0.23364999890327454, 0.3321000039577484, -0.16091999411582947, 0.29131001234054565, -0.17024999856948853, 0.14803999662399292, -0.39517998695373535, -0.4806300103664398, -0.24796999990940094], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.13338999450206757, 0.23050999641418457, 0.42906999588012695, -0.225600004196167, 0.1442199945449829, -0.07770799845457077, 0.6637899875640869, -0.47077998518943787, -0.2905600070953369, 0.6571999788284302, 0.8250100016593933, 0.1767600029706955, -0.516219973564148, 0.858519971370697, 0.22357000410556793, 0.5040500164031982, -0.38242000341415405, -1.1523000001907349, 0.3638400137424469, 0.6343399882316589, 0.3799000084400177, 0.5480999946594238, -0.3008899986743927, -0.0815889984369278, -0.45622000098228455, 0.5265899896621704, 1.146299958229065, -0.36035001277923584, -0.14215999841690063, 0.036247000098228455, -0.812529981136322, 0.6534799933433533, 0.30840998888015747, 0.542680025100708, -0.5672000050544739, 0.0605349987745285, 0.11088000237941742, 0.4923900067806244, -0.08525200188159943, -0.7503799796104431, 0.11552999913692474, -0.29207998514175415, -1.1150000095367432, -0.0768439993262291, 0.2462799996137619, 0.041512999683618546, 0.13842999935150146, -0.39096999168395996, -0.5325300097465515, 0.3694300055503845, -0.3619000017642975, -0.6585800051689148, -0.337660014629364, -0.655239999294281, -0.4747700095176697, 0.5431399941444397, 0.32583001255989075, 0.9329000115394592, -0.5574600100517273, 0.1481499969959259, -0.5692999958992004, -0.2997699975967407, -0.20106999576091766, -0.20534999668598175, -0.3853999972343445, 0.6013299822807312, -0.47567999362945557, 0.32506000995635986, 0.6998500227928162, 0.4697999954223633, -0.4584900140762329, 0.6967499852180481, 0.4647800028324127, -1.4078999757766724, -0.2562499940395355, -0.8894100189208984, -0.06974499672651291, 0.43151000142097473, -0.3978100121021271, -0.5517600178718567, 0.14162999391555786, 0.1765899956226349, 0.4743500053882599, 0.4545300006866455, -0.05221499875187874, 0.1377899944782257, -0.06719499826431274, 0.34661000967025757, -0.25529998540878296, 0.6408200263977051, -0.7076900005340576, 0.5673900246620178, 0.007533600088208914, -0.2865400016307831, 1.118499994277954, 0.5841699838638306, -0.10040000081062317, -0.8084700107574463, -0.2861599922180176, -0.20792999863624573], [-0.5843799710273743, 0.16008999943733215, -0.1295499950647354, 0.3246699869632721, -0.05688700079917908, -0.46255001425743103, 0.2508000135421753, -0.25328999757766724, 0.4811500012874603, 0.03262599930167198, 0.03742999956011772, -0.1161699965596199, -0.45521000027656555, -0.17143000662326813, -0.08442100137472153, 0.01725500077009201, 0.20292000472545624, 0.544950008392334, 0.2972699999809265, 0.3151099979877472, 0.1913599967956543, 0.10211999714374542, -0.7368000149726868, -0.31088000535964966, -0.6595199704170227, 0.6039900183677673, 0.29218998551368713, 0.4630599915981293, 0.3024100065231323, 0.05032699927687645, 0.07513199746608734, -0.15458999574184418, 0.253030002117157, -0.2333499938249588, -0.12592999637126923, -0.37894999980926514, -0.19428999722003937, -0.5087000131607056, 0.2448199987411499, -0.18619999289512634, -0.2665199935436249, -0.3682900071144104, -0.11116000264883041, 0.10599999874830246, -0.0661109983921051, 0.004928300157189369, 0.196710005402565, 0.00672800000756979, 0.2673400044441223, 0.5201200246810913, -0.2809399962425232, 0.25477999448776245, -0.319350004196167, -0.16775000095367432, -0.17533999681472778, 0.8918099999427795, 0.22277000546455383, -0.15198999643325806, -0.6934499740600586, -0.3349500000476837, 0.028248000890016556, -0.13718999922275543, -0.3520500063896179, 0.09807799756526947, -0.4660399854183197, 0.08521900326013565, -0.5771300196647644, -0.509850025177002, -0.46577000617980957, 0.24776999652385712, 0.1418900042772293, 0.12355999648571014, -0.1506199985742569, 0.48750999569892883, -0.016795000061392784, 0.03603700175881386, 0.2863900065422058, -0.35690999031066895, 0.3521899878978729, -0.15672999620437622, -0.34130001068115234, 0.2840699851512909, 0.09078899770975113, -0.21501000225543976, -0.052691999822854996, 0.1564899981021881, -0.11043000221252441, 0.16516000032424927, 0.18302999436855316, 0.22222000360488892, 0.28341999650001526, -0.19968000054359436, 0.27854999899864197, 0.04468899965286255, 0.8767899870872498, 0.12488000094890594, 0.025252999737858772, 0.3889400064945221, -0.2941400110721588, -0.29756999015808105], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.8533999919891357, -1.0262000560760498, -0.5044000148773193, 0.4029900133609772, -0.5149800181388855, -0.051681000739336014, -0.653980016708374, 0.22098000347614288, 1.1130000352859497, -0.2233700007200241, -0.08403199911117554, 0.7925000190734863, -0.4053199887275696, -0.22450000047683716, 0.9299399852752686, -0.5650399923324585, 0.1500300019979477, 0.20985999703407288, 0.31303998827934265, -0.1898300051689148, 0.6040800213813782, 0.2203499972820282, -0.4359799921512604, -0.5797899961471558, -0.15095999836921692, -0.29864999651908875, 0.3184800148010254, -0.34808000922203064, 0.029846999794244766, -0.20350000262260437, -0.7299000024795532, 0.2607499957084656, 0.8988500237464905, 0.7133600115776062, -0.025296000763773918, 0.6151800155639648, 1.5047999620437622, 1.0407999753952026, -0.04631299898028374, -0.7416899800300598, -0.20305000245571136, -0.758679986000061, 